gl-sergei/u2f-token/mcu/usb-efm32hg.c
/*
 * usb-efm32.c - USB driver for EFM32HG
 *
 * Copyright (C) 2017 Sergei Glushchenko
 * Author: Sergei Glushchenko <gl.sergei@gmail.com>
 *
 * This file is a part of Chpostx port to EFM32HG
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 *
 * As additional permission under GNU GPL version 3 section 7, you may
 * distribute non-source form of the Program without the copy of the
 * GNU GPL normally required by section 4, provided you inform the
 * recipients of GNU GPL by a written offer.
 *
 */
#include <stdint.h>
#include <stdlib.h>
#include <string.h>

#include "usb_lld.h"
#include "usb_lld_driver.h"

#include "efm32hg.h"

#define DEPCTL_WO_MASK 0x3c000000UL
#define DCTL_WO_MASK   0x780UL

/* Implementation */

static struct device_req ep0_setup_pkt[3] __attribute__ ((aligned(4)));
static char ctrl_send_buf[USB_MAX_PACKET_SIZE] __attribute__ ((aligned(4)));

/* Enpoint state struct */
struct efm32hg_ep
{
  uint32_t xfersize;
};

/* Output endpoints */
static struct efm32hg_ep oeps[4];

static void
efm32hg_ep_out_stall (uint8_t n)
{
  uint32_t ctl = USB_DOUTEPS[n].CTL & ~DEPCTL_WO_MASK;
  uint32_t eptype = ctl & 0xC0000UL;

  if (eptype != USB_DOEP_CTL_EPTYPE_ISO)
    {
      ctl |= USB_DIEP_CTL_STALL;
      USB_DOUTEPS[n].CTL = ctl;
    }
}

static void
efm32hg_ep_in_stall (uint8_t n)
{
  uint32_t ctl = USB_DOUTEPS[n].CTL & ~DEPCTL_WO_MASK;
  uint32_t eptype = ctl & 0xC0000UL;

  if (eptype != USB_DIEP_CTL_EPTYPE_ISO)
    {
      USB_DINEPS[n].CTL |= USB_DIEP_CTL_STALL;
      if (ctl & USB_DIEP_CTL_EPENA)
        ctl |= USB_DIEP_CTL_EPDIS;
      USB_DINEPS[n].CTL = ctl;
    }
}

static void
efm32hg_ep_out_unstall (uint8_t n)
{
  uint32_t ctl = USB_DOUTEPS[n].CTL & ~DEPCTL_WO_MASK;
  uint32_t eptype = ctl & 0xC0000UL;

  if (eptype == USB_DOEP_CTL_EPTYPE_INT || eptype == USB_DOEP_CTL_EPTYPE_BULK)
    {
      ctl |= USB_DOEP_CTL_SETD0PIDEF;
      ctl &= ~USB_DOEP_CTL_STALL;
      USB_DOUTEPS[n].CTL = ctl;
    }
}

static void
efm32hg_ep_in_unstall (uint8_t n)
{
  uint32_t ctl = USB_DINEPS[n].CTL & ~DEPCTL_WO_MASK;
  uint32_t eptype = ctl & 0xC0000UL;

  if (eptype == USB_DIEP_CTL_EPTYPE_INT || eptype == USB_DIEP_CTL_EPTYPE_BULK)
    {
      ctl |= USB_DIEP_CTL_SETD0PIDEF;
      ctl &= ~USB_DIEP_CTL_STALL;
      USB_DINEPS[n].CTL = ctl;
    }
}

static int
efm32hg_ep_in_is_stall (uint8_t n)
{
  return (USB_DINEPS[n].CTL & USB_DIEP_CTL_STALL) ? 1 : 0;
}

static int
efm32hg_ep_out_is_stall (uint8_t n)
{
  return (USB_DOUTEPS[n].CTL & USB_DOEP_CTL_STALL) ? 1 : 0;
}

static int
efm32hg_ep_in_is_disabled (uint8_t n)
{
  return (USB_DINEPS[n].CTL & USB_DIEP_CTL_EPENA) ? 0 : 1;
}

static int
efm32hg_ep_out_is_disabled (uint8_t n)
{
  return (USB_DOUTEPS[n].CTL & USB_DOEP_CTL_EPENA) ? 0 : 1;
}

static void
efm32hg_set_daddr (uint8_t daddr)
{
  USB->DCFG = (USB->DCFG & ~USB_DCFG_DEVADDR_MASK) | (daddr << 4);
}

static void
efm32hg_enable_ints (void)
{
  /* Disable all interrupts. */
  USB->GINTMSK = 0;

  /* Clear pending interrupts */
  USB->GINTSTS = 0xFFFFFFFF;

  USB->GINTMSK = USB_GINTMSK_USBRSTMSK
                 | USB_GINTMSK_ENUMDONEMSK
                 | USB_GINTMSK_IEPINTMSK
                 | USB_GINTMSK_OEPINTMSK;
}

static void
efm32hg_disable_ep_in (uint8_t n)
{
  USB_DINEPS[n].CTL = 0;
  USB->DAINTMSK &= ~(1 << n);
}

static void
efm32hg_disable_ep_out (uint8_t n)
{
  USB_DINEPS[n].CTL = 0;
  USB->DAINTMSK &= ~(1 << (n + 16));
}

static void
efm32hg_prepare_ep0_setup (struct usb_dev *dev)
{
  (void) dev;

  USB->DOEP0TSIZ = (8*3 <<  0)  /* XFERSIZE */
                   | (1 << 19)  /* PKTCNT */
                   | (3 << 29); /* SUPCNT */
  USB->DOEP0DMAADDR = (uint32_t) &ep0_setup_pkt;
  USB->DOEP0CTL = (USB->DOEP0CTL & ~DEPCTL_WO_MASK) | USB_DOEP0CTL_EPENA;
}

static void
efm32hg_prepare_ep0_out (const void *buf, size_t len, uint32_t ep0mps)
{
  USB->DOEP0DMAADDR = (uint32_t) buf;
  USB->DOEP0TSIZ = (len <<  0)  /* XFERSIZE */
                   | (1 << 19); /* PKTCNT */
  USB->DOEP0CTL = (USB->DOEP0CTL & ~DEPCTL_WO_MASK)
                  | USB_DOEP0CTL_CNAK | USB_DOEP0CTL_EPENA
                  | ep0mps;
}

static void
efm32hg_prepare_ep0_in (const void *buf, size_t len, uint32_t ep0mps)
{
  USB->DIEP0DMAADDR = (uint32_t) buf;
  USB->DIEP0TSIZ = (len <<  0)  /* XFERSIZE */
                   | (1 << 19); /* PKTCNT */
  USB->DIEP0CTL = (USB->DIEP0CTL & ~DEPCTL_WO_MASK)
                  | USB_DIEP0CTL_CNAK | USB_DIEP0CTL_EPENA
                  | ep0mps;
}

static void
handle_datastage_out (struct usb_dev *dev)
{
  struct ctrl_data *data_p = &dev->ctrl_data;
  uint32_t len = USB->DOEP0TSIZ & 0x7FUL; /* XFERSIZE */
  uint32_t pktsize = 64 >> (USB->DIEP0CTL & 0x3UL);

  data_p->len -= len;
  data_p->addr += len;

  len = data_p->len < pktsize ? data_p->len : pktsize;

  if (data_p->len == 0)
    {
      /* No more data to receive, proceed to send acknowledge for IN.  */
      efm32hg_prepare_ep0_setup (dev);
      dev->state = WAIT_STATUS_IN;
      efm32hg_prepare_ep0_in (NULL, 0, 0);
    }
  else
    {
      dev->state = OUT_DATA;
      efm32hg_prepare_ep0_out (data_p->addr, len, 0);
    }
}

static void
handle_datastage_in (struct usb_dev *dev)
{
  struct ctrl_data *data_p = &dev->ctrl_data;
  uint32_t len = 64 >> (USB->DOEP0CTL & 0x3UL);

  if ((data_p->len == 0) && (dev->state == LAST_IN_DATA))
    {
      if (data_p->require_zlp)
        {
          data_p->require_zlp = 0;

          efm32hg_prepare_ep0_setup (dev);
          /* No more data to send.  Send empty packet */
          efm32hg_prepare_ep0_in (NULL, 0, 0);
        }
      else
        {
          /* No more data to send, proceed to receive OUT acknowledge.  */
          dev->state = WAIT_STATUS_OUT;
          efm32hg_prepare_ep0_out (NULL, 0, 0);
        }

      return;
    }

  dev->state = (data_p->len <= len) ? LAST_IN_DATA : IN_DATA;

  if (len > data_p->len)
    len = data_p->len;

  efm32hg_prepare_ep0_setup (dev);
  efm32hg_prepare_ep0_in (data_p->addr, len, 0);
  data_p->len -= len;
  data_p->addr += len;
}

typedef int (*HANDLER) (struct usb_dev *dev);

static int
std_none (struct usb_dev *dev)
{
  (void)dev;
  return -1;
}

static uint16_t status_info __attribute__((aligned(4)));

static int
std_get_status (struct usb_dev *dev)
{
  struct device_req *arg = &dev->dev_req;
  uint8_t rcp = arg->type & RECIPIENT;

  if (arg->value != 0 || arg->len != 2 || (arg->index >> 8) != 0
      || USB_SETUP_SET (arg->type))
    return -1;

  if (rcp == DEVICE_RECIPIENT)
    {
      if (arg->index == 0)
        {
          /* Get Device Status */
          uint8_t feature = dev->feature;

