gl-sergei/u2f-token/mcu/usb-efm32hg.c
  return USB_EVENT_OK;
}

static int
handle_out0 (struct usb_dev *dev)
{
  if (dev->state == OUT_DATA)
    /* It's normal control WRITE transfer.  */
    handle_datastage_out (dev);
  else if (dev->state == WAIT_STATUS_OUT)
    { /* Control READ transfer done successfully.  */
      efm32hg_prepare_ep0_setup (dev);
      dev->state = WAIT_SETUP;
    }
  else
    {
      /*
       * dev->state == IN_DATA || dev->state == LAST_IN_DATA
       * (Host aborts the transfer before finish)
       * Or else, unexpected state.
       * STALL the endpoint, until we receive the next SETUP token.
       */
      dev->state = STALLED;
      efm32hg_ep_out_stall (ENDP0);
      efm32hg_ep_in_stall (ENDP0);
      dev->state = WAIT_SETUP;
      efm32hg_prepare_ep0_setup (dev);
    }
    return USB_EVENT_OK;
}


struct efm32hg_rev
{
  uint8_t family;
  uint8_t minor;
  uint8_t major;
};

void
efm32hg_revno (struct efm32hg_rev *rev)
{
  uint8_t tmp;

  /* CHIP FAMILY bit [5:2] */
  tmp  = ((ROMTABLE->PID1 & 0xf) << 2);
  /* CHIP FAMILY bit [1:0] */
  tmp |=  ((ROMTABLE->PID0 & 0xc0) >> 6);
  rev->family = tmp;
 
  /* CHIP MAJOR bit [3:0] */
  rev->major = (ROMTABLE->PID0 & 0x3f);
 
  /* CHIP MINOR bit [7:4] */
  tmp  = (((ROMTABLE->PID2 & 0xf0) >> 4) << 4);
  /* CHIP MINOR bit [3:0] */
  tmp |=  ((ROMTABLE->PID3 & 0xf0) >> 4);
  rev->minor = tmp;
}

void
efm32hg_usb_init (void)
{
  struct efm32hg_rev rev;

  /* Ensure selected oscillator is enabled, waiting for it to stabilize */
  CMU->OSCENCMD = CMU_OSCENCMD_LFRCOEN;
  while (!(CMU->STATUS & CMU_STATUS_LFRCORDY));

  /* Select LFRCO as LFCCLK clock */
  CMU->LFCLKSEL = (CMU->LFCLKSEL & ~0x30UL) | (0x1 /* LFRCO */ << 4 /* LFC */);

  CMU->LFCCLKEN0 |= CMU_LFCCLKEN0_USBLE;

  /* Enable USB clock */
  CMU->HFCORECLKEN0 |= CMU_HFCORECLKEN0_USB | CMU_HFCORECLKEN0_USBC;

  CMU->USHFRCOCONF = CMU_USHFRCOCONF_BAND_48MHZ;

  /* Select USHFRCO as clock source for USB */
  CMU->OSCENCMD = CMU_OSCENCMD_USHFRCOEN;
  while (!(CMU->STATUS & CMU_STATUS_USHFRCORDY));

  /* Switch oscillator */
  CMU->CMD = CMU_CMD_USBCCLKSEL_USHFRCO;

  /* Wait until clock is activated */
  while ((CMU->STATUS & CMU_STATUS_USBCUSHFRCOSEL) == 0);

  /* Enable USHFRCO Clock Recovery mode. */
  CMU->USBCRCTRL |= CMU_USBCRCTRL_EN;

  /* Turn on Low Energy Mode (LEM) features. */
  efm32hg_revno (&rev);

  if ((rev.family == 5) && (rev.major == 1) && (rev.minor == 0))
    {
      /* First Happy Gecko chip revision did not have 
      all LEM features enabled. */
      USB->CTRL = USB_CTRL_LEMOSCCTRL_GATE
                  | USB_CTRL_LEMIDLEEN
                  | USB_CTRL_LEMPHYCTRL;
    }
  else
    {
      USB->CTRL = USB_CTRL_LEMOSCCTRL_GATE
                  | USB_CTRL_LEMIDLEEN
                  | USB_CTRL_LEMPHYCTRL
                  | USB_CTRL_LEMNAKEN
                  | USB_CTRL_LEMADDRMEN;
    }

}

static void
efm32hg_connect (void)
{
  USB->DCTL &= ~(DCTL_WO_MASK | USB_DCTL_SFTDISCON);
}

static void __attribute__((unused))
efm32hg_disconnect (void)
{
  USB->DCTL = (USB->DCTL & ~ DCTL_WO_MASK) | USB_DCTL_SFTDISCON;
}

static void
efm32hg_flush_rx_fifo (void)
{
  USB->GRSTCTL = USB_GRSTCTL_RXFFLSH;
  while (USB->GRSTCTL & USB_GRSTCTL_RXFFLSH) {}
}

static void
efm32hg_flush_tx_fifo (uint8_t n)
{
  USB->GRSTCTL = USB_GRSTCTL_TXFFLSH | (n << 6);
  while (USB->GRSTCTL & USB_GRSTCTL_TXFFLSH) {}
}

void
efm32hg_core_reset (void)
{
  USB->PCGCCTL &= ~USB_PCGCCTL_STOPPCLK;
  USB->PCGCCTL &= ~(USB_PCGCCTL_PWRCLMP | USB_PCGCCTL_RSTPDWNMODULE);

  /* Core Soft Reset */
  USB->GRSTCTL |= USB_GRSTCTL_CSFTRST;
  while (USB->GRSTCTL & USB_GRSTCTL_CSFTRST) {}

  /* Wait for AHB master IDLE state. */
  while (!(USB->GRSTCTL & USB_GRSTCTL_AHBIDLE)) {}
}

int
efm32hg_core_init (void)
{
  const uint32_t total_rx_fifo_size = 128;
  const uint32_t total_tx_fifo_size = 256;
  const uint32_t ep_tx_fifo_size = 64;
  uint32_t address, depth;
  uint8_t ep;

  USB->ROUTE = USB_ROUTE_PHYPEN; /* Enable PHY pins.  */

  efm32hg_core_reset ();

  /* Setup full speed device */
  USB->DCFG = (USB->DCFG & ~USB_DCFG_DEVSPD_MASK) | USB_DCFG_DEVSPD_FS;

  /* Stall on non-zero len status OUT packets (ctrl transfers). */
  USB->DCFG |= USB_DCFG_NZSTSOUTHSHK;

  /* Set periodic frame interval to 80% */
  USB->DCFG &= ~USB_DCFG_PERFRINT_MASK;

  USB->GAHBCFG = (USB->GAHBCFG & ~USB_GAHBCFG_HBSTLEN_MASK)
                 | USB_GAHBCFG_DMAEN | USB_GAHBCFG_HBSTLEN_SINGLE;

  /* Ignore frame numbers on ISO transfers. */
  USB->DCTL = (USB->DCTL & ~DCTL_WO_MASK) | USB_DCTL_IGNRFRMNUM;

  /* Set Rx FIFO size */
  USB->GRXFSIZ = total_rx_fifo_size;

  /* Set Tx EP0 FIFO size */
  address = total_rx_fifo_size;
  depth = ep_tx_fifo_size;
  USB->GNPTXFSIZ = (depth << 16 /*NPTXFINEPTXF0DEP*/) | address /*NPTXFSTADDR*/;

  /* Set Tx EP FIFO sizes for all IN ep's */
  for (ep = 1; ep <= MAX_NUM_IN_EPS; ep++)
    {
      address += depth;
      depth = ep_tx_fifo_size;
      USB_DIEPTXFS[ep - 1] = (depth << 16)           /* INEPNTXFDEP */
                             | (address & 0x7FFUL);  /* INEPNTXFSTADDR */
    }

  if (total_rx_fifo_size + total_tx_fifo_size > MAX_DEVICE_FIFO_SIZE_INWORDS)
    return -1;

  if (address > MAX_DEVICE_FIFO_SIZE_INWORDS)
    return -1;

  /* Flush the FIFO's */
  efm32hg_flush_tx_fifo (0x10);        /* All Tx FIFO's */
  efm32hg_flush_rx_fifo ();            /* The Rx FIFO   */

  /* Disable all device interrupts */
  USB->DIEPMSK    = 0;
  USB->DOEPMSK    = 0;
  USB->DAINTMSK   = 0;
  USB->DIEPEMPMSK = 0;

  /* Disable all EP's, clear all EP ints. */
  for (ep = 0; ep <= MAX_NUM_IN_EPS; ep++)
    {
      USB_DINEPS[ep].CTL  = 0;
      USB_DINEPS[ep].TSIZ = 0;
      USB_DINEPS[ep].INT  = 0xFFFFFFFF;
    }

  for (ep = 0; ep <= MAX_NUM_OUT_EPS; ep++)
    {
      USB_DOUTEPS[ep].CTL  = 0;
      USB_DOUTEPS[ep].TSIZ = 0;
      USB_DOUTEPS[ep].INT  = 0xFFFFFFFF;
    }

  efm32hg_connect ();

  return 0;
}

/* INTERFACE */

void
usb_lld_init (struct usb_dev *dev, uint8_t feature)
{
  usb_lld_set_configuration (dev, 0);
  dev->feature = feature;
  dev->state = WAIT_SETUP;

  efm32hg_usb_init ();

