gl-sergei/u2f-token/mcu/usb-efm32hg.c
  efm32hg_core_init ();

  efm32hg_set_daddr (0);

  /* Unmask interrupts for TX and RX */
  USB->GAHBCFG |= USB_GAHBCFG_GLBLINTRMSK;
  USB->GINTMSK = /*USB_GINTMSK_USBSUSPMSK
                 |*/ USB_GINTMSK_USBRSTMSK
                 | USB_GINTMSK_ENUMDONEMSK
                 | USB_GINTMSK_IEPINTMSK
                 | USB_GINTMSK_OEPINTMSK
                 /*| USB_GINTMSK_WKUPINTMSK*/;
  USB->DAINTMSK = USB_DAINTMSK_INEPMSK0 | USB_DAINTMSK_OUTEPMSK0;
  USB->DOEPMSK  = USB_DOEPMSK_SETUPMSK | USB_DOEPMSK_XFERCOMPLMSK
                  | USB_DOEPMSK_STSPHSERCVDMSK;
  USB->DIEPMSK  = USB_DIEPMSK_XFERCOMPLMSK;
}


#define USB_MAKE_EV(event) (event<<24)
#define USB_MAKE_TXRX(ep_num,txrx,len) ((txrx? (1<<23):0)|(ep_num<<16)|len)

int
usb_lld_event_handler (struct usb_dev *dev)
{
  uint32_t intsts = USB->GINTSTS & USB->GINTMSK;
  uint16_t len;
  uint8_t ep;
  int r = USB_EVENT_OK;

  if (intsts & USB_GINTSTS_USBRST)
    {
      USB->GINTSTS = USB_GINTSTS_USBRST;
      return USB_MAKE_EV (USB_EVENT_DEVICE_RESET);
    }

  if (intsts & USB_GINTSTS_ENUMDONE)
    {
      USB->GINTSTS = USB_GINTSTS_ENUMDONE;
      efm32hg_prepare_ep0_setup (dev);
      efm32hg_enable_ints ();
      dev->state = WAIT_SETUP;
    }

  if (intsts & USB_GINTSTS_IEPINT)
    {
      uint32_t epint = USB->DAINT & USB->DAINTMSK;

      ep = 0;
      while (epint != 0)
        {
          if (epint & 1)
            {
              uint32_t sts = USB_DINEPS[ep].INT & USB->DIEPMSK;
              if (sts & USB_DIEP_INT_XFERCOMPL)
                {
                  USB_DINEPS[ep].INT = USB_DIEP_INT_XFERCOMPL;
                  if (ep == 0)
                    r = handle_in0 (dev);
                  else
                    {
                      len = USB_DINEPS[ep].TSIZ & 0x7FFFFUL; /* XFERSIZE */
                      if (USB_DINEPS[ep].INT & USB_DIEP_INT_NAKINTRPT)
                        USB_DINEPS[ep].INT = USB_DIEP_INT_NAKINTRPT;
                      return USB_MAKE_TXRX (ep, 1, len);
                    }
                }
            }
          ep++;
          epint >>= 1;
        }
    }

  if (intsts & USB_GINTSTS_OEPINT)
    {
      uint32_t epint = (USB->DAINT & USB->DAINTMSK) >> 16;

      ep = 0;
      while (epint != 0)
        {
          if (epint & 1)
            {
              uint32_t sts = USB_DOUTEPS[ep].INT & USB->DOEPMSK;

              if (ep == 0 && sts & USB_DOEP0INT_STUPPKTRCVD)
                {
                  USB_DOUTEPS[ep].INT = USB_DOEP0INT_STUPPKTRCVD;
                  sts &= ~USB_DOEP_INT_XFERCOMPL;
                }

              if (sts & USB_DOEP_INT_XFERCOMPL)
                {
                  USB_DOUTEPS[ep].INT = USB_DOEP_INT_XFERCOMPL;
                  if (ep == 0)
                    {
                      sts = USB->DOEP0INT & USB->DOEPMSK;

                      USB_DOUTEPS[ep].INT = USB_DOEP0INT_STUPPKTRCVD;

                      if (sts & USB_DOEP0INT_SETUP)
                        {
                          USB->DOEP0INT = USB_DOEP0INT_SETUP;
                          int supcnt = (USB->DOEP0TSIZ & 0x60000000UL) >> 29;
                          supcnt = (supcnt == 3) ? 2 : supcnt;
                          dev->dev_req = ep0_setup_pkt[2 - supcnt];
                          r = handle_setup0 (dev);
                        }
                      else
                        r = handle_out0 (dev);
                    }
                  else /* ep != 0 */
                    {
                      uint32_t remain = USB_DOUTEPS[ep].TSIZ & 0x7FFFFUL; /* XFERSIZE */
                      if (remain < oeps[ep].xfersize)
                        len = oeps[ep].xfersize - remain;
                      else
                        len = 0;
                      return USB_MAKE_TXRX (ep, 0, len);
                    }
                }

              if (sts & USB_DOEP0INT_STSPHSERCVD)
                USB->DOEP0INT = USB_DOEP0INT_STSPHSERCVD;
            }
          ep++;
          epint >>= 1;
        }
    }

  return USB_MAKE_EV (r);
}

/*
 * BUF: Pointer to data memory.  Data memory should not be allocated
 *      on stack when BUFLEN > USB_MAX_PACKET_SIZE.
 *
 * BUFLEN: size of the data.
 */
int
usb_lld_ctrl_send (struct usb_dev *dev, const void *buf, size_t buflen)
{
  struct ctrl_data *data_p = &dev->ctrl_data;
  uint32_t len_asked = dev->dev_req.len;
  uint32_t len;
  uint32_t pktsize = 64 >> (USB->DIEP0CTL & 0x3UL);

  data_p->addr = (void *)buf;
  data_p->len = buflen;

  /* Restrict the data length to be the one host asks for */
  if (data_p->len > len_asked)
    data_p->len = len_asked;

  data_p->require_zlp = (data_p->len != 0 && (data_p->len % pktsize) == 0);

  if (((uint32_t) data_p->addr & 3) && (data_p->len <= pktsize))
    {
      data_p->addr = (void *) ctrl_send_buf;
      memcpy (data_p->addr, buf, buflen);
    }

  if (data_p->len < pktsize)
    {
      len = data_p->len;
      dev->state = LAST_IN_DATA;
    }
  else
    {
      len = pktsize;
      dev->state = IN_DATA;
    }

  efm32hg_prepare_ep0_in (data_p->addr, len, 0);

  data_p->len -= len;
  data_p->addr += len;

  return USB_EVENT_OK;
}

int
usb_lld_ctrl_recv (struct usb_dev *dev, void *p, size_t len)
{
  struct ctrl_data *data_p = &dev->ctrl_data;
  uint32_t pktsize = 64 >> (USB->DIEP0CTL & 0x3UL);
  data_p->addr = (uint8_t *)p;
  data_p->len = len;
  if (len > pktsize)
    len = pktsize;

  efm32hg_prepare_ep0_out (p, len, 0);
  dev->state = OUT_DATA;
  return USB_EVENT_OK;
}

int
usb_lld_ctrl_ack (struct usb_dev *dev)
{
  /* Zero length packet for ACK.  */
  efm32hg_prepare_ep0_setup (dev);
  dev->state = WAIT_STATUS_IN;
  efm32hg_prepare_ep0_in (NULL, 0, 0);
  return USB_EVENT_OK;
}

void
usb_lld_ctrl_error (struct usb_dev *dev)
{
  dev->state = STALLED;
  efm32hg_ep_out_stall (ENDP0);
  efm32hg_ep_in_stall (ENDP0);
  dev->state = WAIT_SETUP;
  efm32hg_prepare_ep0_setup (dev);
}

void
usb_lld_reset (struct usb_dev *dev, uint8_t feature)
{
  int i;

  usb_lld_set_configuration (dev, 0);
  dev->feature = feature;
  dev->state = WAIT_SETUP;

  /* Clear Remote Wakeup Signalling */
  USB->DCTL &= ~(DCTL_WO_MASK | USB_DCTL_RMTWKUPSIG);
  efm32hg_flush_tx_fifo (0);

  /* Clear pending interrupts */
  for (i = 0; i <= MAX_NUM_IN_EPS; i++)
    USB_DINEPS[i].INT = 0xFFFFFFFF;

  for (i = 0; i <= MAX_NUM_OUT_EPS; i++)
    USB_DOUTEPS[i].INT = 0xFFFFFFFF;

  USB->DAINTMSK = USB_DAINTMSK_INEPMSK0 | USB_DAINTMSK_OUTEPMSK0;
  USB->DOEPMSK = USB_DOEPMSK_SETUPMSK | USB_DOEPMSK_XFERCOMPLMSK
                | USB_DOEPMSK_STSPHSERCVDMSK;
  USB->DIEPMSK = USB_DIEPMSK_XFERCOMPLMSK;

  /* Reset Device Address */
  efm32hg_set_daddr (0);

  /* Setup EP0 to receive SETUP packets */
  efm32hg_prepare_ep0_setup (dev);
  efm32hg_enable_ints ();

  for (int i = 0; i < MAX_NUM_IN_EPS; ++i)
    efm32hg_disable_ep_in (i);

  for (int i = 0; i < MAX_NUM_OUT_EPS; ++i)
    efm32hg_disable_ep_out (i);
}

void
usb_lld_set_configuration (struct usb_dev *dev, uint8_t config)
{
  dev->configuration = config;
}

uint8_t
usb_lld_current_configuration (struct usb_dev *dev)
{
  return dev->configuration;
}

void
usb_lld_tx_enable_buf (int ep_num, const void *buf, size_t len)
{
  uint32_t pktsize;
  uint32_t pktcnt, xfersize;

  if (ep_num == 0)
    pktsize = 64 >> (USB->DIEP0CTL & 0x3UL);
  else
    pktsize = USB_DINEPS[ep_num].CTL & 0x7FFUL;

  if (len == 0)
    {
      /* zlp */
      pktcnt = 1;
      xfersize = 0;
    }
  else
    {
      pktcnt = (len - 1 + pktsize) / pktsize;
      xfersize = len;
    }

  USB_DINEPS[ep_num].TSIZ = (USB_DINEPS[ep_num].TSIZ & ~0x7fffffff)
                            | (xfersize << 0)
                            | (pktcnt << 19);
  USB_DINEPS[ep_num].DMAADDR = (uint32_t) buf;
  USB_DINEPS[ep_num].CTL = (USB_DINEPS[ep_num].CTL & ~DEPCTL_WO_MASK)
                           | USB_DIEP_CTL_CNAK
                           | USB_DIEP_CTL_EPENA;
}

void
usb_lld_rx_enable_buf (int ep_num, void *buf, size_t len)
{
  uint32_t pktsize;
  uint32_t pktcnt, xfersize;

  if (ep_num == 0)
    pktsize = 64 >> (USB->DOEP0CTL & 0x3UL);
  else
    pktsize = USB_DOUTEPS[ep_num].CTL & 0x7FFUL;

  if (len == 0)
    {
      /* zlp */
      pktcnt = 1;
      xfersize = 0;
    }
  else
    {
      pktcnt = (len - 1 + pktsize) / pktsize;
      xfersize = pktcnt * pktsize;
    }

  oeps[ep_num].xfersize = xfersize;

