gl-sergei/u2f-token/mcu/usb-efm32hg.c
  USB_DOUTEPS[ep_num].TSIZ = (USB_DOUTEPS[ep_num].TSIZ & ~0x1fffffff)
                             | (xfersize << 0)
                             | (pktcnt << 19);
  USB_DOUTEPS[ep_num].DMAADDR = (uint32_t) buf;
  USB_DOUTEPS[ep_num].CTL = (USB_DOUTEPS[ep_num].CTL & ~DEPCTL_WO_MASK)
                            | USB_DOEP_CTL_CNAK
                            | USB_DOEP_CTL_EPENA;
}

void
usb_lld_setup_endp (struct usb_dev *dev, int ep_num, int ep_type,
                    int rx_en, int tx_en, int maxpacket)
{
  uint32_t ctl;
  uint32_t mps;

  mps = maxpacket;

  if (ep_num == 0)
    {
      if (maxpacket == 64)
        mps = 0;
      else if (maxpacket == 32)
        mps = 1;
      else if (maxpacket == 16)
        mps = 2;
      else if (maxpacket == 8)
        mps = 3;
      else
        mps = 0;
    }

  if (tx_en)
  {
    /* enpoint is not active */

    ctl = (mps << 0)                    /* max packet size */
          | (ep_num << 22)              /* TX FIFO number */
          | USB_DIEP_CTL_SETD0PIDEF
          | USB_DIEP_CTL_USBACTEP
          | USB_DIEP_CTL_SNAK;

    switch (ep_type)
      {
        case EP_CONTROL:
          ctl |= USB_DIEP_CTL_EPTYPE_CONTROL;
          break;
        case EP_BULK:
          ctl |= USB_DIEP_CTL_EPTYPE_BULK;
          ctl &= ~USB_DIEP_CTL_STALL;
          break;
        case EP_ISOCHRONOUS:
          ctl |= USB_DIEP_CTL_EPTYPE_ISO;
          break;
        case EP_INTERRUPT:
          ctl |= USB_DIEP_CTL_EPTYPE_INT;
          ctl &= ~USB_DIEP_CTL_STALL;
          break;
      }
    USB_DINEPS[ep_num].CTL = ctl;

    /* enable interrupt for this endpoint */
    USB->DAINTMSK |= (1 << ep_num);
  }

  if (rx_en)
  {
    ctl = (mps << 0)                     /* max packet size */
          | USB_DOEP_CTL_SETD0PIDEF
          | USB_DOEP_CTL_USBACTEP
          | USB_DOEP_CTL_SNAK;

    switch (ep_type)
      {
        case EP_CONTROL:
          ctl |= USB_DOEP_CTL_EPTYPE_CONTROL;
          break;
        case EP_BULK:
          ctl |= USB_DOEP_CTL_EPTYPE_BULK;
          ctl &= ~USB_DOEP_CTL_STALL;
          break;
        case EP_ISOCHRONOUS:
          ctl |= USB_DOEP_CTL_EPTYPE_ISO;
          break;
        case EP_INTERRUPT:
          ctl |= USB_DOEP_CTL_EPTYPE_INT;
          ctl &= ~USB_DOEP_CTL_STALL;
          break;
      }
    USB_DOUTEPS[ep_num].CTL = ctl;

    /* enable interrupt for this endpoint */
    USB->DAINTMSK |= (1 << (ep_num + 16));
  }

  if (ep_num == 0)
    {
      USB->DCTL = (USB->DCTL & ~DCTL_WO_MASK) | USB_DCTL_CGNPINNAK;
      efm32hg_prepare_ep0_setup (dev);
    }
}

void
usb_lld_stall_rx (int ep_num)
{
  efm32hg_ep_out_stall (ep_num);
}

void
usb_lld_stall_tx (int ep_num)
{
  efm32hg_ep_in_stall (ep_num);
}
